{
    "en": {
        "portfolio": {
            "elevatorPitch": {
                "title": "About me",
                "pitch": [
                    "I'm a senior product manager who believes shipping great products is about balancing user needs, technical excellence, and smart constraints. I focus on what actually matters—collaborating closely with developers, partnering with designers from day one, and keeping the whole team aligned on what we're building.",
                    "I'm passionate about delivering value through working software, cutting out the noise, and fostering strong partnerships between product, engineering, and design."
                ]
            },
            "home": {
                "name": "Adrien Dubois",
                "lastName": "Ahlqvist",
                "title": "Senior product manager, Web wizard",
                "homePitch": "Senior product manager with a passion for shipping great products. I combine strategic thinking with hands-on execution across product, design, and engineering."
            },
            "projects": [
                {
                    "name": "Facebook Event Tracker",
                    "duration": "2020",
                    "country": "Canada",
                    "link": "https://github.com/Armitage35/facebook-event-tracker",
                    "cover": "FacebookEventTracker",
                    "place": "ArmitageWeb",
                    "description": [
                        "A CLI tool that helps non-Facebook users discover and stay updated on events they care about."
                    ]
                },
                {
                    "name": "Fuzzy Roadmap",
                    "duration": "2019",
                    "country": "Canada",
                    "link": "https://github.com/Armitage35/fuzzy-roadmap/",
                    "cover": "FuzzyRoadmap",
                    "place": "ArmitageWeb",
                    "description": [
                        "An intuitive tool for creating fuzzy time roadmaps in seconds. Designed to help stakeholders understand what's being worked on and what's next—without the unreliable estimates. Perfect for tracking progress across four states: in progress, soon, later, done."
                    ]
                },
                {
                    "name": "Day2Day.wallpaper",
                    "duration": "2018",
                    "country": "Canada",
                    "link": "https://github.com/Armitage35/day2day.wallpaper",
                    "cover": "Day2DayWallapaper",
                    "place": "ArmitageWeb",
                    "description": [
                        "A Chrome extension that solves Chrome OS's limited wallpaper management. Easily browse and discover beautiful photos to personalize your device."
                    ]
                },
                {
                    "name": "Day2Day.password",
                    "duration": "2018",
                    "link": "https://github.com/Armitage35/day2day.password",
                    "cover": "Day2DayPassword",
                    "country": "Canada",
                    "place": "ArmitageWeb",
                    "description": [
                        "A Chrome extension for generating strong, unique passwords on the fly. Encourages better security practices by making it easy to use a different password for every account."
                    ]
                },
                {
                    "name": "Day2Day",
                    "duration": "2017-2018",
                    "link": "https://github.com/Armitage35/day2day",
                    "cover": "Day2Day",
                    "country": "Canada",
                    "place": "ArmitageWeb",
                    "description": [
                        "A productivity-focused Chrome extension that replaces your default homepage. Combines a to-do list, notepad, Pocket integration, and curated photos from Unsplash—plus weather—to help you tackle your day all in one place."
                    ]
                }
            ],
            "sideMenu": {
                "findMe": "Find me on",
                "contactsInfo": [
                    {
                        "name": "email",
                        "content": "adrien.dubois35@gmail.com",
                        "link": "mailto:"
                    },
                    {
                        "name": "phone",
                        "content": "+1 438 924 3959",
                        "link": "tel:"
                    }
                ],
                "socialNetworks": [
                    {
                        "name": "Linkedin",
                        "link": "https://www.linkedin.com/in/adrien-d-ahlqvist-4179b33b/",
                        "icon": "fab fa-linkedin-in"
                    },
                    {
                        "name": "GitHub",
                        "link": "https://github.com/Armitage35/",
                        "icon": "fab fa-github"
                    },
                    {
                        "name": "Behance",
                        "link": "https://www.behance.net/armitageweb",
                        "icon": "fab fa-behance"
                    },
                    {
                        "name": "Dribble",
                        "link": "https://dribbble.com/armitageweb",
                        "icon": "fas fa-basketball-ball"
                    }
                ]
            },
            "skills": [
                {
                    "name": "Code",
                    "description": [
                        {
                            "name": "JavaScript"
                        },
                        {
                            "name": "CSS/SASS"
                        },
                        {
                            "name": "React"
                        },
                        {
                            "name": "Vue.js"
                        },
                        {
                            "name": "Git"
                        },
                        {
                            "name": "Node.js"
                        },
                        {
                            "name": "CI/CD"
                        },
                        {
                            "name": "SQL"
                        },
                        {
                            "name": "MongoDB"
                        },
                        {
                            "name": "RestAPI"
                        },
                        {
                            "name": "GraphQL"
                        }
                    ]
                },
                {
                    "name": "Design",
                    "description": [
                        {
                            "name": "Photoshop"
                        },
                        {
                            "name": "Sketch"
                        },
                        {
                            "name": "Adobe XD"
                        },
                        {
                            "name": "InVision"
                        },
                        {
                            "name": "Balsamiq wireframes"
                        },
                        {
                            "name": "Illustrator"
                        }
                    ]
                },
                {
                    "name": "Product Management",
                    "description": [
                        {
                            "name": "Jira"
                        },
                        {
                            "name": "Confluence"
                        },
                        {
                            "name": "GitHub"
                        },
                        {
                            "name": "GitLab"
                        },
                        {
                            "name": "Trello"
                        },
                        {
                            "name": "Mixpanel"
                        },
                        {
                            "name": "Google Analytics"
                        },
                        {
                            "name": "Google Data Studio"
                        },
                        {
                            "name": "Excel"
                        },
                        {
                            "name": "Segment"
                        },
                        {
                            "name": "Mailchimp"
                        }
                    ]
                }
            ],
            "testimonials": [
				{
					"quote": "Adrien is an outstanding product manager. He stays close to the developers, truly understands their day-to-day work, and always explains new features with clarity. Visionary and ahead of both the market and his peers, he brings rare strategic direction. Working with him made our collaboration smoother, more effective, and genuinely inspiring. I highly recommend him.",
					"person": "Zied MAKTOUF - Senior Software Engineer at Numa"
				},
                {
                    "quote": "Adrien brings a very unique perspective to product development. He has a clear vision of where the product needs to go in order to satisfy client requirements, sometimes even adding features that the clients didn't even know they needed but that turn out to be industry differentiators. In addition to this, because of his technical background, he's able to have nuanced technology discussions and understand the point of view of developers, at times prioritizing non-functional work, like tackling technical debt, that will enable the team to deliver faster and more robust product features down the line.",
                    "person": "Mario Muniz - Senior Engineer at Shopify"
                },
                {
                    "quote": "I had the immense pleasure of working with Adrien for almost two years, and never once did he fail to impress me with his great attention to detail, rigorousness and brilliancy which made him a reference for everyone working with him. He can adapt, improvise and overcome any problem",
                    "person": "Roméo Labonté - Senior Software Architect"
                }
            ],
            "education": [
                {
                    "name": "Master of Information Technology - Independent candidate",
                    "place": "NUI Galway",
                    "duration": "2014-2015",
                    "country": "Ireland",
                    "clickable": false,
                    "description": [
                        "Blended technical coursework in coding and software engineering with digital marketing fundamentals."
                    ]
                },
                {
                    "name": "Bachelor's degree in management",
                    "country": "Sweden",
                    "place": "Högskolan i Halmstad",
                    "duration": "2012-2013",
                    "clickable": false,
                    "description": [
                        "Focused on technology and digital marketing, with a thesis exploring how brand trust spreads in online communities."
                    ]
                },
                {
                    "name": "Bachelor in international management",
                    "country": "France",
                    "place": "Groupe ESC Troyes",
                    "duration": "2010-2014",
                    "clickable": false,
                    "description": [
                        "Broad management and business foundation with emphasis on international markets, specializing in entrepreneurship."
                    ]
                }
            ],
            "work": [
                {
                    "name": "Senior Product manager",
                    "place": "Hivestack - Perion, Montreal",
                    "duration": "2021-Today",
                    "country": "Canada",
                    "description": [
                        "Hivestack is a marketing technology company that helps advertisers target consumers based on where they are and places they’ve been. It consists of an adserver, an SSP, a DSP, a data platform, a programmatic exchange as well as of a curation platform. Hivestack’s full ad tech stack platform includes an SSP for DOOH media owners, an ad exchange with APIs to monetize unsold inventory, a geotemporal DOOH ad server, and a DSP used by digital agencies to buy DOOH programmatically. It was sold in 2023 by Perion Network for 100M USD.",
                        "I built our SSP from scratch to help publishers maximize revenue by connecting their inventory with more buyers. Defining the product vision, roadmap, and backlog—then collaborating with design and development to execute—we scaled an early-stage idea into a $168M annual revenue product serving 35 countries.",
                        "We then repeated this feat by building a new curation platform that allows an entirely new cast of actors to come in and editorialize the OOH market. Once again, in the span of two years we took an idea that was new to our industry and turned it into a platform that generated 8.2M USD in its second year of existence.",
                        "I also served on the IAB committee for DOOH, helping shape new industry standards—including OOH guidelines, venue taxonomy, and expanded openRTB fields.",
						"Finally, in keeping with our times, we built a few IA powered systems, mainly to help around creative approval and monitoring as well as one to help with campaign building and optimization."
                    ],
                    "cover": "hivestack",
                    "tech": [
                        "Python",
                        "Go",
                        "Vue.js",
                        "Redshift",
                        "Microsoft MySQL",
                        "AWS",
						"Clickhouse and Kafka"
                    ],
                    "appraisal": "",
                    "context": "Scale the Hivestack SSP, curation platform and adserver products from idea to market leading products in a highly competitive environment.",
                    "results": [
                        "Built an SSP generating 168M USD per year in two years",
                        "Built a curation platform generating 8.2M USD in its second year",
                        "Lead most products at some point in their life cycle and was in charge of up to 28 developers simultaneously",
						"Built a deploy a first of its kind DOOH sustainability platform"
                    ],
                    "clickable": true,
                    "link": "http://hivestack.com/"
                },
                {
                    "name": "Technical Product owner",
                    "place": "Valtech, Montreal",
                    "duration": "2020-2021",
                    "country": "Canada",
                    "description": [
                        "Valtech is a global business transformation agency delivering innovation with purpose.",
                        "At Valtech, I was a Product Owner on diverse projects: big data for Pratt & Whitney, eCommerce for Tiffany, virtual events for Uni-Select, and more. I turned ideas into reality—unblocking issues before they slowed teams down.",
                        "Wearing multiple hats, I actively supported my teams with design, code, data analysis, and client management alongside standard product ownership work."
                    ],
                    "cover": "valtech",
                    "tech": [
                        "Sitecore",
                        "Contentful",
                        "Commercetools",
                        ".net",
                        "Microsoft MySQL",
                        "IIS",
                        "Vue.js",
                        "Swift",
                        "SASS"
                    ],
                    "appraisal": "",
                    "context": "",
                    "results": [
                        ""
                    ],
                    "clickable": true,
                    "link": "https://www.valtech.com/fr-ca/"
                },
                {
                    "name": "Technical Product owner",
                    "place": "Jogogo, Montreal",
                    "duration": "2018-2019",
                    "country": "Canada",
                    "description": [
                        "Jogogo is a physical space analytics tool that lets its users track and engage their visitors based on their activity. I was the Product Owner for both the App and the API and implemented a SCRUM process that enabled us to complete the redesigns of both our App (React) and our API (GraphQL). Both of the APP and API were used by enterprise clients such as Decathlon, Desjardins, Asmodee, Telus, IBM and Cisco."
                    ],
                    "cover": "Jogogo",
                    "clickable": true,
                    "tech": [
                        "Node.js",
                        "React.js",
                        "Kafka",
                        "Cassandra",
                        "PostgreSQL",
                        "GraphQL",
                        "Rust",
                        "Typescript",
                        "Vue.js",
                        "Ngnix",
                        "SASS",
                        "LESS"
                    ],
                    "appraisal": "When I started, the team lacked clear processes, regularly missed deadlines, and had visibility issues across the company. Through structured methodology, the App & API team became a model for organization and productivity. We shipped ambitious features—including a public GraphQL API and a complete React front-end rewrite—and significantly improved user satisfaction.",
                    "context": "Joined Jogogo as Product Owner for the App and API team, tasked with introducing structure, improving cross-team visibility, and enabling team growth.",
                    "results": [
                        "Implementation of the Scrum methodology",
                        "Implementation of complexity point estimation",
                        "Organization and animation of retrospectives, daily meeting, Poker planning, sprint planning",
                        "Implementation of guidelines development and code review",
                        "Deployment of Jira and Confluence",
                        "Backlog management and roadmap monitoring (fuzzy time roadmap)",
                        "Writing user stories / functional and technical specifications",
                        "Deployment management and communication",
                        "Implementation of a design system and production of prototypes",
                        "Front-end development",
                        "Design & deployment of a home made WiFi sniffer"
                    ],
                    "link": "https://www.behance.net/gallery/86647847/Jogogo-Location-analytics"
                },
                {
                    "name": "Product owner",
                    "place": "Technology Evaluation Centers, Montreal",
                    "country": "Canada",
                    "duration": "2017-2018",
                    "description": [
                        "TEC is an enterprise tool that enables enterprises to find the software that best suits their needs. I acted as Product Owner for our website and tools and led a team of twenty people through a technological redesign of our websites and internal tools (ASP.NET and Kentico). I also oversaw and participated in the visual redesign of the website."
                    ],
                    "cover": "Tec",
                    "tech": [
                        "CSS (Sass)",
                        "Jquery",
                        "SQL",
                        "Elasticsearch",
                        "IIS",
                        ".net",
                        "Kentico",
                        "Bootstrap"
                    ],
                    "appraisal": "Successfully transitioned knowledge from the departing team and restructured two new groups around agile practices. By project end, both teams were functional and aligned on converting the broader organization to agile.",
                    "context": "Reorganized Internal Tools and website teams around Scrum practices. Hired during a transition when the previous team departed, tasked with building new cross-functional product capabilities.",
                    "results": [
                        "Implementation of the Scrum methodology",
                        "Organization and animation of retrospectives, Daily meeting, Poker planning, sprint planning",
                        "Backlog management and roadmap monitoring",
                        "Writing user stories / functional and technical specifications",
                        "Prototyping & Wireframing",
                        "Deployment management and communication",
                        "Management of a cross-functional product team",
                        "Modern development process implementation (code review, CI, versioning…)"
                    ],
                    "clickable": true
                },
                {
                    "name": "Growth hacker & Product Owner",
                    "place": "Placeloop, Paris",
                    "country": "France",
                    "duration": "2015-2017",
                    "description": [
                        "Placeloop is a trade marketing platform that enables brands to provide their resellers with marketing campaigns. I acted as Growth Hacker and Product Owner and was in charge of the app's design, implementation, adoption and revenue. Our biggest challenge was a mobile-first redesign of the application (React). Our clients included SAB Miller, Kérastase and L'Oréal Professionnel."
                    ],
                    "cover": "Placeloop",
                    "tech": [
                        "JS",
                        "SASS",
                        "NodeJS",
                        "MongoDB",
                        "Elasticsearch",
                        "React",
                        "OPA",
                        "Bootstrap"
                    ],
                    "appraisal": "The approach we developed convinced L’Oréal Professionnel and other major brands to roll out Placeloop across all their brands for their retailers. These methods also helped the product team scale and grow effectively.",
                    "context": "Deployment of Placeloop to first customers and users via L'Oréal Professional brands, monitoring of usage, implementation of activation and retention strategies. Organization and monitoring of development, production of prototypes and implementation of quality processes.",
                    "results": [
                        "Deployment of the Placeloop solution with many brands of L'Oréal professionnel and SAB Miller",
                        "Placement of pilots",
                        "Growth hacking and systematization of the AARRR model",
                        "Backlog and roadmap management",
                        "Writing user stories / functional and technical specifications",
                        "Wireframing & prototyping",
                        "Functional tests",
                        "Implementation of customer return systems and creation of a team ,in charge of maintaining it",
                        "Redesign of our front-end applications",
                        "Back-end redesign and deployment of a private API",
                        "Transition from MongoDB to Elasticsearch",
                        "Deployment of paid features"
                    ],
                    "clickable": true
                },
                {
                    "name": "Growth hacker & Product manager",
                    "place": "Pryv, Lausanne",
                    "country": "Switzerland",
                    "description": [
                        "Pryv is a privacy-focused company that enables life loggers and self quantifiers to store and to access data to make sense of it. I acted as Growth Hacker and Product Manager and was in charge of the Apps' release and adoption. I was also the point of contact between the business and development teams. Finally, I oversaw partnerships with Moves, Misfits and IFTTT."
                    ],
                    "cover": "Pryv",
                    "tech": [
                        "MongoDB",
                        "Jquery",
                        "Java"
                    ],
                    "appraisal": "In a few months we have had more than three thousand subscribers and several partnerships with major players in our industry.",
                    "context": "After two years of development, Pryv was ready to launch Alpha and Beta releases to validate the market and secure new funding.",
                    "results": [
                        "Backlog and roadmap management",
                        "Writing user stories / functional and technical specifications",
                        "Wireframing & prototyping",
                        "Functional tests",
                        "Implementation of user feedback systems",
                        "Establishment of partnerships (IFTTT, Misfit, Jawbone…)",
                        "Implementation of the Growth hacking AARRR model"
                    ],
                    "duration": "2014",
                    "clickable": true
                }
            ],
            "footer": {
                "brag": "Need help for your next project?",
                "email": {
                    "contact": "adrien.dubois35@gmail.com",
                    "legend": "Get in touch—I'd love to chat."
                },
                "copyrights": "Design and code by Adrien D. Ahlqvist",
                "seeCode": {
                    "text": "View source",
                    "link": "https://github.com/Armitage35/portfolio/"
                }
            }
        },
        "cv": {
            "contact": [
                {
                    "name": "email",
                    "description": "adrien.dubois35@gmail.com",
                    "link": "mailto:",
                    "icon": "fa-envelope"
                },
                {
                    "name": "telephone",
                    "description": "+1 438 924 3959",
                    "link": "tel:",
                    "icon": "fa-phone-alt"
                }
            ]
        },
        "technicalFile": {
            "summary": "Summary",
            "back": "  Back to the resume"
        }
    }
}
